{
  "category": "city_events",
  "tables": {
    "city_events": [
      "An exhausted corpse-carter maketh his way to the graves, his cart groaning under a full load of the recently departed.",
      "d4 nobles take their constitutional, thrashing the common folk with gilded clubs most mercilessly.",
      "A travelling weed-merchant doth enquire for directions to the Seer's dwelling, his satchel reeking of strange herbs.",
      "A street urchin painteth \"HEARKEN!\" upon a crumbling wall with the crimson blood of a goat.",
      "A waste-cart trundleth past, its putrid cargo causing even the hardiest souls to retch and flee.",
      "Melancholic melodies drift from a broke and starving gutter bard, his lute strings frayed as his hopes.",
      "There lieth a corpse in the thoroughfare. Not even the mangy curs trouble themselves to care.",
      "A poor child weepeth in a shadowed corner, lost, cold, and forsaken by all.",
      "The sudden cacophony of wings and croaks - a murder of crows descendeth like harbingers of doom.",
      "Heavy rains doth fall. The streets empty as folk seek shelter from the heavens' wrath.",
      "A fishmonger attempteth to ward off a pack of ravenous stray cats with naught but curses and a stick.",
      "A procession of masked flagellants passeth by, cursing and screaming their devotions to uncaring gods.",
      "Decadent acrobats, high on strange vapours and bereft of wit, do nearly break their necks in folly.",
      "A desperate family laboureth to rebuild their burnt hovel from charred timber and shattered dreams.",
      "An old man slumpeth against a wall, panting and clutching his failing heart with gnarled fingers.",
      "A hopelessly despondent farmer stareth at the grey sky, having lost everything to blight and misfortune.",
      "A heartbroken young fool seeketh comfort in alley-found dregs and questionable spirits.",
      "A huge load of refuse and waste crasheth down, hurled from some high window by unknown hands.",
      "An old crone lieth helpless in the gutter, her walking crutch stolen by heartless thieves.",
      "A drunken clerk stumbleth and falleth, his scrolls and maps scattered like autumn leaves.",
      "Ragged beggars fight over stale bread whilst guards do watch and place their wagers with cruel mirth.",
      "A peg-legged mariner doth waylay the party to regale them with tales of the fearsome Angloarfish.",
      "Labourers bear a boat-sized casket to an anonymous priest, their burden heavy with secrets untold.",
      "A penniless carpenter (or so he claimeth) doth attempt to peddle a worn and weathered crutch.",
      "A tavern patron is violently ejected from his cups, then robbed of his purse, then stabbed for good measure.",
      "A chittering wave of a hundred rats doth scurry across the cobblestones like a living carpet of pestilence.",
      "A group of ragtag scoundrels playeth Three Dead Skulls with dice most cunningly weighted.",
      "Suddenly, a crossbow bolt doth strike a nearby door - someone practiceth their murderous arts.",
      "Around the corner standeth a mighty gallows-tree, adorned with a dozen hanged heretics swaying in the wind.",
      "A score of souls keepeth warm about a crackling bonfire, yet one amongst them is a Grift spy.",
      "Folk maintain their distance from a rabid hound that forageth through refuse with foam upon its maw.",
      "Three battle-hardened mercenaries drag the carcass of a slain troll across the bloodstained street.",
      "A severely hungover chaplain doth curse the wretched state of this fallen world.",
      "The pungent aroma of dry snuff, exotic herbs, and hashish wafteth from a crowded marketplace.",
      "Two chattering monkeys feast upon the rotting remains of a once-proud raven.",
      "An explosion! Smoke and screams rise from the ruins of an alchemist's workshop, experiments gone awry.",
      "A wild-eyed demagogue yelleth about prophetic falsehoods whilst guards hasten to silence his blasphemy.",
      "A devastated, eyeless peasant standeth locked in the pillory, begging piteously for but a drop of water.",
      "A well-used and rust-stained guillotine is being cleaned and sharpened for its next grisly performance.",
      "An occultist placeth copper coins in intricate patterns, weaving some dark enchantment upon the stones."
    ]
  },
  "metadata": {
    "version": "1.0",
    "language": "en",
    "last_updated": "2025-08-07T22:56:40.000000",
    "description": "Mörk Borg city events (d4 d10 table)",
    "usage": "Roll d4 d10 to determine what filth the city vomits",
    "migrated_from": "databases/languages/en/city_events.json"
  }
}