{
  "city_name": "Alliáns",
  "display_name": "Alliáns - A Cidade-Torre de Vidro Negro que Perfura as Tempestades",
  "description": "Alliáns é descrita como uma **cidade-torre de vidro negro que perfura as tempestades**, servindo como o trono da **Condessa de Sangue Anthelia**, a governante de Kergüs. É o local do **grande torneio de Sua Excelência**, um evento final antes do fim de todas as coisas, atraindo **famílias nobres** de seu domínio. A própria Anthelia é retratada como **eternamente jovem** mas sobrecarregada por **neuroses**, **drenando calor e cor** de seus arredores com sua própria presença. A vida na corte dentro de Alliáns é caracterizada por uma mistura de **opulência cinza, excitação e medo**, refletindo os **poderes absolutos e sentimentos frágeis** da Condessa. O frio que rola dos sonhos da Condessa contribui ainda mais para a atmosfera da cidade.",
  "theme": "dark_fantasy_court_tournament",
  "district_matrix": [
    [
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ],
    [
      "",
      "",
      "",
      "City Core",
      "City Core",
      "",
      "",
      "",
      "",
      ""
    ]
  ],
  "districts": [
    {
      "name": "City Core",
      "description": "The entirety of Alliáns, an urban landscape composed of **black glass spires**. This area encompasses Anthelia's castle, the tournament grounds, and the residences of the noble families attending the tournament. The atmosphere is consistently cold, marked by **grey opulence** and an undercurrent of **excitement and fear**.",
      "theme": "spire_city_cold_opulence",
      "buildings": [
        "Anthelia's Castle",
        "Tournament Grounds"
      ],
      "streets": [
        "No specific named streets are mentioned in the sources for Alliáns. Streets would likely be within the spire-city, connecting its various levels and structures.",
        "Passageways of Black Glass"
      ],
      "landmarks": [
        "The Tournament Field (or Arena)",
        "Anthelia's Balcony"
      ],
      "encounters": [
        "**Nobles**, often appearing fatigued or scarred from weeks of fighting, seeking healing or attempting to gain favor with Anthelia.",
        "**Burghers** or **servants** involved in the tournament arrangements, possibly offering late-entrance fees for proxies.",
        "Spectators and participants discussing the tournament or its rules.",
        "**Guards** or attendants enforcing Anthelia's unpredictable whims, especially concerning tournament rules and post-bout celebrations."
      ],
      "random_tables": [
        "1-2: A bout is underway, with combatants following the **Rules of the List**, scored by successful strikes and providing healing after each round.",
        "3-4: A **repast and dancing session** is occurring, where the food is tasteless and causes bloating (cumulative +1 DR to Agility tests) and the dances are nonsensical, leading to exhaustion (cumulative +1 DR to Strength tests).",
        "5-6: A combatant is compelled to 'Answer to Anthelia' on her balcony, potentially facing consequences such as an **Arcane Catastrophe**, exposure to **Black Salt Winds**, developing a **Worse Habit**, rolling on the **Broken table**, receiving Kergüs items, or being granted Anthelia's favor."
      ],
      "atmosphere_modifiers": [
        "A constant **coldness** permeates the air, as if warmth is being drained from the environment.",
        "An underlying tension and **fear** is palpable, stemming from Anthelia's absolute power and unpredictable nature.",
        "The ubiquitous gleam of **black glass structures** characterizes the visual landscape.",
        "The sounds of ongoing bouts, cheers, and murmurs from the tournament grounds are ever-present.",
        "A pervasive sense of impending doom, given the tournament is explicitly referred to as 'the final tournament to be held before the end of all things'."
      ]
    }
  ],
  "buildings": [
    {
      "name": "Anthelia's Castle",
      "description": "The central and most prominent structure in Alliáns, a **castle of white stone likened to a waterfall**, serving as the throne of **Blood-Countess Anthelia**. It embodies **grey opulence** and is the heart of court life, filled with both **excitement and fear**."
    },
    {
      "name": "Tournament Grounds",
      "description": "The designated area or arena where the tournament bouts are held. It is where **hundreds of nobles** seek renown, engaging in combat under the 'Rules of the List'. It includes areas for **repasts and dancing**, though these activities are described as unpleasant."
    }
  ],
  "streets": [],
  "landmarks": [
    {
      "name": "The Tournament Field (or Arena)",
      "description": "The primary location within the Tournament Grounds where combatants face off. It is the site of intense duels and pivotal moments in the quest for Anthelia's favor or the rumored prize of heirship."
    },
    {
      "name": "Anthelia's Balcony",
      "description": "A prominent feature within Anthelia's Castle, from which the Countess might demand a combatant to 'stand and endure' consequences for their actions in the tournament."
    }
  ],
  "markets": [],
  "temples": [
    {
      "name": "Former/Hidden Alliáns Cult Site",
      "description": "While not explicitly described as a temple, sources mention a 'Massacred Alliáns cult', suggesting a history of non-orthodox religious practices within or near the city. Its remnants could be a hidden or ruined site."
    }
  ],
  "taverns": [],
  "guilds": [],
  "residences": [
    {
      "name": "Noble Residences",
      "description": "The temporary or permanent dwellings of the **noble families** called to attend Anthelia's tournament, serving as bases for the combatants and their retinue."
    }
  ],
  "ruins": [],
  "encounters": {
    "district": [
      "Nobles, weary from weeks of fighting, seeking healing or attempting to gain favor with Anthelia.",
      "Burghers or servants involved in the tournament, possibly offering late-entrance fees for proxies.",
      "Guards or attendants enforcing Anthelia's unpredictable whims, especially concerning tournament rules and post-bout celebrations."
    ],
    "building": [
      "**Anthelia herself**, observing the tournament or interacting with combatants, showcasing her 'fragile feelings' and 'absolute powers'.",
      "**Tournament combatants** (e.g., Jahnt the Younger, Rocque de Rocque, Bon Slotare, Grastun the Fair, Caul the Murder-maid, Brast de Gaion, Strygmon the Unstable, Haalder the Defenestrator, Eadaeter the Censer-bearer, Gargarix of Eastspire, Chutlem of Westspire, Vuntler of Under-the-Narthex, Rilp Squint the Doom-denied, Jaak Plowshare, Sigrayn of Wyrms Wood, Gwerthon the Outlander, Molglum the Witch-marked, Brutt Maukargsson, Rogust of Wästlands Edge, Brichunne the Fameseeker of Onda, Namun Glory-Gained-at-Graven-Tosk, Okbahn the Cryptborn, Jyra of Schleswig, Xemal Half-a-face, Harlegtum of Terion-march, Krundall the Pious, Teiful Friedling, Skoph of Bridgeside, Tlemna the Walking Ledger of Mur, Blyned de Rednayls) [6, 11, 13-21], engaging in bouts or resting.",
      "**Acolytes** attending Krundall the Pious, potentially sacrificing themselves to prevent him from being injured."
    ],
    "street": [
      "Nobles and their retinues moving between the castle and tournament grounds, showing signs of fatigue or injury.",
      "Commoners and servants going about daily life, under the pervasive cold and tension of the city.",
      "Individuals with **prior relationships with PCs**, based on past interactions like theft, battlefield encounters, disputes, crypt plundering, or servitude."
    ],
    "landmark": [
      "A combatant attempting to 'Answering to Anthelia' on her balcony, facing arcane catastrophes or vital draining.",
      "Combatants during repasts and dancing, enduring tasteless food and exhausting, nonsensical dances.",
      "Players engaging in tournament bouts, following the specific 'Rules of the List'."
    ],
    "market": [],
    "temple": [
      "Whispers or remnants of the 'Massacred Alliáns cult', hinting at a hidden or forgotten site related to their past."
    ],
    "tavern": [],
    "guild": [],
    "residence": [
      "Nobles preparing for bouts, nursing injuries, or engaging in courtly intrigue.",
      "Servants tending to their noble masters, reflecting the 'grey opulence' of court life."
    ],
    "ruins": []
  },
  "random_tables": {
    "district": [
      "1-2: A formal procession of nobles and their retinues, moving with tattered banners and soiled armor.",
      "3-4: The city is gripped by a sudden chill, and distant wails are heard, as if from Anthelia herself.",
      "5-6: A public decree from Anthelia's court regarding the tournament or a new, unsettling rule."
    ],
    "building": [
      "1-2: A combatant 'Answering to Anthelia', leading to one of the listed consequences (e.g., Arcane Catastrophe, Black Salt Winds, Worse Habit, Broken table, Kergüs items, or Anthelia's favor).",
      "3-4: A participant 'Retiring from the Tourney', resulting in one of the grim prizes (e.g., death at Anthelia's hands, renunciation of titles, delivering loved ones into service, silver with hand cut off, unheroic feats, or a unique gift).",
      "5-6: A bout takes place, scored by successful strikes, with healing provided after each round."
    ],
    "street": [
      "1-2: A group of Nobles passes by, discussing their fatigue from weeks of fighting.",
      "3-4: The sudden disappearance of signs of a suitor who sought Anthelia's hand, reinforcing rumors of her eternal youth.",
      "5-6: A burst of unsettling, non-discernible music or unsettling whispers echoes through the black glass structures."
    ],
    "landmark": [
      "1-2: Combatants endure the tasteless food and exhausting dances of a repast.",
      "3-4: A formal challenge is issued on the tournament field, with specific weapons or conditions requested.",
      "5-6: A combatant uses a unique ability in battle (e.g., Caul the Murder-maid injuring an audience member, Strygmon the Unstable's fluctuating DR, Haalder attempting to throw opponents)."
    ],
    "market": [],
    "temple": [
      "1-2: Whispers of the 'Massacred Alliáns cult' are heard, hinting at a hidden or forgotten site related to their past.",
      "3-4: A lone survivor, perhaps a Heretical Priest with an 'unholy origin', is seen lurking near historical or former sacred grounds."
    ],
    "tavern": [],
    "guild": [],
    "residence": [
      "1-2: A noble lamenting their lost glory or reflecting on the 'sorrow' of their station, echoing themes from the Wretched Royalty class.",
      "3-4: Servants complain about the oppressive 'grey opulence' and constant fear in the Countess's court.",
      "5-6: A noble is observed secretly attempting to 'cheat' the tournament system, perhaps by offering bribes or seeking outside help."
    ]
  },
  "atmosphere_modifiers": [
    "The pervasive sense that **the world dies even now**, with reality decaying around Alliáns.",
    "A **chilling coldness** that seems to emanate from Anthelia's presence, draining warmth from the environment.",
    "The grim beauty of the **black glass architecture**, reflecting the bleakness of Kergüs.",
    "Undercurrents of **excitement and fear** among the populace, particularly intensified during the tournament.",
    "The distinct taste of desolation and the 'stench of blood' carried on the wind from the west of the sundered land.",
    "Occasional sounds of exhaustion and discomfort during repasts and dancing, despite the attempt at celebration."
  ],
  "metadata": {
    "migrated_from": "databases/cities/allians.json",
    "language": "pt",
    "last_updated": "2025-01-16T00:00:00.000000",
    "translation_needed": true,
    "translation_note": "This file needs Portuguese translation of city names, descriptions, and content"
  }
}