{
  "category": "city_events",
  "tables": {
    "city_events": [
      "Exhausted corpse-carter heading for the graves with a full load.",
      "d4 nobles promenading, beating people beneath them with gilded clubs.",
      "Travelling weed-merchant asking for directions to the Seer's.",
      "Urchin painting \"LISTEN!\" with goat's blood on a wall.",
      "Passing wastecart/barge. The stench is unbearable.",
      "Melancholic melodies from a broke, starving gutter bard.",
      "There's a dead body in the street. Not even the dogs seem to care.",
      "Poor child crying in a corner. Lost, cold and alone.",
      "The sudden cacophony of wings and croaks. A murder of crows.",
      "Heavy rain. The streets are cleared as people seek shelter.",
      "Fishmonger trying to fend off a pack of stray cats.",
      "Procession of masked flagellants. Cursing and screaming.",
      "Decadent acrobats, high and witless. Almost break their necks.",
      "Family desperately trying to rebuild their burnt hovel.",
      "Old man slumped against a wall. Panting, grabbing his heart.",
      "Hopelessly depressed farmer stares at the sky. Has lost everything.",
      "Heartbroken young fool seeking comfort in alley-found dregs.",
      "Huge load of trash and waste splashes down, thrown from a window.",
      "Old woman lying in the gutter. Someone stole her crutch.",
      "Drunken clerk stumbling, falling. Scrolls and maps everywhere.",
      "Rags-clad people fighting over bread. Guards watching. Placing bets.",
      "Peglegged sailor stops the PCs to brag about the Angloarfish.",
      "Laborers carrying a boat-size casket to an anonymous priest.",
      "Penniless carpenter (so they say) trying to sell a worn crutch.",
      "Patron violently escorted from a pub. Then robbed. Then stabbed.",
      "A chittering wave of a hundred rats scurry across the street.",
      "Group of ragtag scum playing Three Dead Skulls with weighted dice.",
      "Suddenly, a crossbow bolt hits a nearby door. Someone is practicing.",
      "Around the corner, a giant tree with a dozen hanged heretics.",
      "Twenty people keeping warm around a bonfire. One is a Grift spy.",
      "People keeping distance from a rabid dog rummaging in the trash.",
      "Three hardened mercenaries pull a dead troll across the street.",
      "Severely hungover chaplain cursing the state of things.",
      "The smell of dry snuff, herbs and hash from a crowded market.",
      "Two monkeys eating what's left of a dead raven.",
      "Explosion! Smoke and screams from a ruined alchemist's workshop.",
      "Demagogue yelling about prophecy falsehood. Guards on their way.",
      "Devastated, eyeless peasant in a pillory. Begs for water.",
      "Well-used, rusty guillotine being repaired and cleaned.",
      "Occultist placing copper coins in intricate patterns."
          ]
  },
  "metadata": {
    "version": "1.0",
    "language": "en",
    "last_updated": "2025-01-27T10:00:00.000000",
    "description": "Mörk Borg city events (d4 d10 table)",
    "usage": "Roll d4 d10 to determine what filth the city vomits"
  }
} 