{
  "category": "city_events",
  "tables": {
    "city_events": [
      "Um carroceiro de cadáveres exausto dirige-se às sepulturas, sua carroça gemendo sob o peso dos recém-finados.",
      "d4 nobres fazem seu passeio, espancando a plebe com clavas douradas de modo cruel e impiedoso.",
      "Um mercador errante de ervas inquire pelas direcções à morada do Vidente, sua sacola exalando aromas estranhos.",
      "Um órfão pinta \"ESCUTAI!\" numa parede arruinada com o sangue carmesim de uma cabra.",
      "Uma carroça de dejetos passa trôpega, sua carga pútrida fazendo até as almas mais rijas vomitar e fugir.",
      "Melodias melancólicas fluem de um bardo faminto e arruinado da sarjeta, as cordas de sua lira esfiadas como suas esperanças.",
      "Jaz um cadáver na via pública. Nem os cães sarnosos se dão ao trabalho de se importar.",
      "Uma criança pobre chora num canto sombrio, perdida, com frio, e abandonada por todos.",
      "A súbita cacofonia de asas e grasnidos - uma revoada de corvos desce como arautos da perdição.",
      "Chuvas pesadas caem dos céus. As ruas se esvaziam quando as gentes buscam abrigo da ira celestial.",
      "Um peixeiro tenta repelir uma alcateia de gatos vadios famintos com nada mais que praguejos e um pau.",
      "Uma procissão de flagelantes mascarados passa, amaldiçoando e gritando suas devoções a deuses surdos.",
      "Acrobatas decadentes, embriagados de vapores estranhos e desprovidos de juízo, quase quebram o pescoço em sua tolice.",
      "Uma família desesperada labuta para reconstruir seu tugúrio queimado de madeira carbonizada e sonhos despedaçados.",
      "Um velho se escoima contra uma parede, ofegante e agarrando seu coração claudicante com dedos nodosos.",
      "Um camponês desesperadamente despondente fita o céu cinzento, tendo perdido tudo à praga e ao infortúnio.",
      "Um jovem tolo de coração quebrado busca consolo em bebedeiras de beco e espíritos questionáveis.",
      "Uma carga imensa de refugo e dejetos despenca, arremessada de alguma janela alta por mãos desconhecidas.",
      "Uma velha bruxa jaz desamparada na sarjeta, sua muleta de caminhar roubada por ladrões sem coração.",
      "Um escrivão bêbado tropeça e cai, seus pergaminhos e mapas espalhados como folhas de outono.",
      "Mendigos esfarrapados brigam por pão velho enquanto guardas observam e fazem suas apostas com crueldade jovial.",
      "Um marinheiro perna-de-pau intercepta o grupo para regalar-lhes com contos do temível Angloarfish.",
      "Trabalhadores carregam um caixão do tamanho de um barco para um sacerdote anônimo, seu fardo pesado de segredos não contados.",
      "Um carpinteiro sem vintém (ou assim alega) tenta vender uma muleta gasta e desgastada pelo tempo.",
      "Um freguês de taverna é violentamente expulso de seus copos, depois roubado de sua bolsa, depois esfaqueado para completar a medida.",
      "Uma onda guinchante de cem ratos percorre as pedras da calçada como um tapete vivo de pestilência.",
      "Um grupo de vilões esfarrapados joga Três Caveiras Mortas com dados astutamente viciados.",
      "Subitamente, um virote de besta fere uma porta próxima - alguém pratica suas artes homicidas.",
      "Ao dobrar da esquina ergue-se uma poderosa árvore de forcas, ornada com uma dúzia de hereges enforcados balançando ao vento.",
      "Uma vintena de almas se aquece ao redor de uma fogueira crepitante, contudo um dentre eles é espião de Grift.",
      "As gentes mantêm sua distância de um cão raivoso que fuça através do lixo com espuma na boca.",
      "Três mercenários endurecidos pela batalha arrastam a carcaça de um troll morto pela rua ensanguentada.",
      "Um capelão severamente ressacado amaldiçoa o estado miserável deste mundo caído.",
      "O aroma pungente de rapé seco, ervas exóticas, e haxixe flutua de um mercado apinhado.",
      "Dois macacos tagarelas se banqueteiam com os restos podres de um corvo outrora altivo.",
      "Uma explosão! Fumaça e gritos sobem das ruínas da oficina de um alquimista, experimentos que deram errado.",
      "Um demagogo de olhos selvagens berra sobre falsidades proféticas enquanto guardas se apressam a silenciar sua blasfêmia.",
      "Um camponês devastado e sem olhos permanece trancado no pelourinho, implorando piedosamente por apenas uma gota d'água.",
      "Uma guilhotina bem usada e manchada de ferrugem está sendo limpa e afiada para sua próxima apresentação macabra.",
      "Um ocultista coloca moedas de cobre em padrões intrincados, tecendo algum encantamento sombrio sobre as pedras."
    ]
  },
  "metadata": {
    "version": "1.0",
    "language": "pt",
    "last_updated": "2025-08-07T22:56:40.000000",
    "description": "Eventos urbanos de Mörk Borg (tabela d4 d10)",
    "usage": "Rola d4 d10 para determinar que imundície a cidade vomita",
    "migrated_from": "databases/languages/en/city_events.json"
  }
}