{
  "category": "city_events",
  "tables": {
    "city_events": [
      "Carroceiro de cadáveres exausto dirigindo-se às sepulturas com carga completa.",
      "d4 nobres passeando, espancando os plebeus com clavas douradas.",
      "Mercador de ervas errante pedindo direcções para a casa do Vidente.",
      "Órfão pintando \"ESCUTAI!\" com sangue de cabra numa parede.",
      "Carroça de lixo/barcaça passando. O fedor é insuportável.",
      "Melodias melancólicas de um bardo faminto e arruinado da sarjeta.",
      "Há um cadáver na rua. Nem os cães parecem importar-se.",
      "Criança pobre chorando num canto. Perdida, com frio e sozinha.",
      "A súbita cacofonia de asas e grasnidos. Um bando de corvos.",
      "Chuva forte. As ruas esvaziaram-se quando as pessoas procuram abrigo.",
      "Peixeiro tentando afugentar uma matilha de gatos vadios.",
      "Procissão de flagelantes mascarados. Amaldiçoando e gritando.",
      "Acrobatas decadentes, altivos e insensatos. Quase partem o pescoço.",
      "Família tentando desesperadamente reconstruir o seu tugúrio queimado.",
      "Velho encostado à parede. Ofegante, agarrando o coração.",
      "Camponês desesperadamente deprimido fita o céu. Perdeu tudo.",
      "Jovem tolo de coração partido procura consolo em bebedeiras de beco.",
      "Carga enorme de lixo e dejetos espatifa-se, atirada de uma janela.",
      "Velha deitada na sarjeta. Alguém roubou-lhe a muleta.",
      "Escrivão bêbado cambaleando, caindo. Pergaminhos e mapas por todo o lado.",
      "Pessoas esfarrapadas lutando por pão. Guardas observando. Fazendo apostas.",
      "Marinheiro perna-de-pau para os PCs para se gabar do Angloarfish.",
      "Trabalhadores carregando um caixão do tamanho de um barco para um sacerdote anónimo.",
      "Carpinteiro sem eira nem beira (assim dizem) tentando vender uma muleta gasta.",
      "Freguês violentamente escoltado de uma taberna. Depois roubado. Depois esfaqueado.",
      "Uma onda guinchante de cem ratos atravessa a rua a correr.",
      "Grupo de escumalha esfarrapada jogando Três Caveiras Mortas com dados viciados.",
      "Subitamente, um virote de besta acerta numa porta próxima. Alguém está a praticar.",
      "Ao virar da esquina, uma árvore gigante com uma dúzia de hereges enforcados.",
      "Vinte pessoas aquecendo-se numa fogueira. Um é espião de Grift.",
      "Pessoas mantendo distância de um cão raivoso remexendo no lixo.",
      "Três mercenários endurecidos arrastam um troll morto pela rua.",
      "Capelão severamente ressacado amaldiçoando o estado das coisas.",
      "O cheiro de rapé seco, ervas e haxixe de um mercado apinhado.",
      "Dois macacos comendo os restos de um corvo morto.",
      "Explosão! Fumo e gritos de uma oficina de alquimista arruinada.",
      "Demagogo gritando sobre falsidade profética. Guardas a caminho.",
      "Camponês devastado e sem olhos num pelourinho. Implora por água.",
      "Guilhotina bem usada e enferrujada sendo reparada e limpa.",
      "Ocultista colocando moedas de cobre em padrões intrincados."
    ]
  },
  "metadata": {
    "version": "1.0",
    "language": "pt",
    "last_updated": "2025-01-16T00:00:00.000000",
    "description": "Eventos urbanos de Mörk Borg (tabela d4 d10)",
    "usage": "Rola d4 d10 para determinar que imundície a cidade vomita",
    "migrated_from": "databases/languages/en/city_events.json"
  }
}